# Wire Type Max Size Property

Source: https://www.revitapidocs.com/2026/9daae522-61ec-5e23-be5c-7a6809370e51.htm

---

| Wire Type Max Size Property |
| --- |

The max conductor size name of the wire type.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public string MaxSize { get; set; }
```

```
Public Property MaxSize As String
	Get
	Set
```

```
public:
property String^ MaxSize {
	String^ get ();
	void set (String^ value);
}
```

```
member MaxSize : string with get, set
```

#### Property Value

String Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The name is neither a conductor size name nor empty. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

WireType Class Autodesk.Revit.DB.Electrical Namespace